In [1]:
import pandas as pd

In [2]:
# Tomamos una muestra, el proceso en la nube usara el archivo completo
df = pd.read_json('../../Data/checkin.json', lines= True, nrows=100000)

In [3]:
df

,business_id,date
0,---kPU91CF4Lq2-WlRu9Lw,"2020-03-13 21:10:56, 2020-06-02 22:18:06, 2020..."
1,--0iUa4sNDFiZFrAdIWhZQ,"2010-09-13 21:43:09, 2011-05-04 23:08:15, 2011..."
2,--30_8IhuyMHbSOcNWd6DQ,"2013-06-14 23:29:17, 2014-08-13 23:20:22"
3,--7PUidqRWpRSpXebiyxTg,"2011-02-15 17:12:00, 2011-07-28 02:46:10, 2012..."
4,--7jw19RH9JKXgFohspgQw,"2014-04-21 20:42:11, 2014-04-28 21:04:46, 2014..."
...,...,...
99995,kbbh3rkueBubhJa_QQjwpA,"2010-05-18 16:37:01, 2010-12-17 21:02:02, 2011..."
99996,kbdepoAfgcsVmngXg2B-5w,"2011-03-04 23:19:17, 2011-03-14 18:11:18, 2011..."
99997,kbeSI3swiGHymmlK2Cznfw,"2010-07-26 01:21:38, 2010-10-01 04:57:36, 2010..."
99998,kbexVWZtu3j87c0SgsaHfw,"2016-01-28 22:55:45, 2016-02-01 18:27:31, 2016..."
99999,kbhEMnNGyPHHvYP19efn_A,2016-12-01 04:59:40

In [4]:
# En la nube, este dataframe es extraido desde Big Query
df2 = pd.read_pickle('../../Data/business.pkl')

In [5]:
# Transformamos los datos parcialmente. En cloud los datos se usaran ya transformados
df2 = df2.loc[:, ~df2.columns.duplicated()]
df2 = df2[df2['city']=='Philadelphia']

In [6]:
# Queremos cargar solo las reviews a negocioes que estan en nuestro otro dataset
df =df[(df['business_id'].isin(df2['business_id']))]

In [7]:
df

,business_id,date
14,--OS_I7dnABrXvRCCuWOGQ,2018-05-11 18:23:36
32,--sXnWH9Xm6_NvIjyuA99w,"2011-06-08 19:26:16, 2011-07-31 02:53:37, 2011..."
48,-0M0b-XhtFagyLmsBtOe8w,"2012-02-09 22:11:59, 2012-02-17 23:03:05, 2012..."
49,-0PN_KFPtbnLQZEeb23XiA,"2011-02-23 05:39:14, 2011-03-01 21:58:33, 2011..."
50,-0TffRSXXIlBYVbb5AwfTg,"2013-05-31 23:03:18, 2013-05-31 23:05:01, 2013..."
...,...,...
99958,kaoDMrIYG6iDU8AhT-G-0g,"2017-12-08 21:29:13, 2018-09-03 22:46:39, 2019..."
99964,kb-U-rFwFhxPtIND8bFGJg,"2012-04-22 01:02:59, 2012-06-28 10:13:52, 2012..."
99976,kbEVlzQLcYS3JSQPG9QMOQ,"2010-02-14 15:32:48, 2010-02-20 17:50:15, 2010..."
99992,kbXGifEQA_2Cqzg8-31MJg,"2016-12-17 17:51:43, 2016-12-30 17:39:27, 2017..."
99993,kbXpjBSweedxQ1WrlJ5i7Q,"2015-07-12 19:12:57, 2015-07-13 16:56:15, 2015..."

In [8]:
df.dtypes

business_id    object
date           object
dtype: object